# Library

In [1]:
import pandas as pd
import numpy as np

## [로드] 말소 데이터

In [31]:
ex_col_df = pd.read_excel('data/220819_22.06월기준_말소_컬럼.xlsx')
ex_col_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   컬럼명     42 non-null     object
dtypes: object(1)
memory usage: 464.0+ bytes

In [32]:
ex_col_df.head()

        컬럼명
0    차량관리번호
1    차량등록번호
2  본거지법정동코드
3     소유자구분
4   차종_등록정보

In [33]:
ex_col = ex_col_df['컬럼명']
len(ex_col)

42

In [34]:
# 53.9s
ex = pd.read_table('data/220819_22.06월기준_말소.txt', header=42, names=ex_col, encoding='cp949')
ex.columns

C:\Users\kbj\AppData\Local\Temp\ipykernel_8084\2834300791.py:2: DtypeWarning: Columns (29,37) have mixed types. Specify dtype option on import or set low_memory=False.
  ex = pd.read_table('data/220819_22.06월기준_말소.txt', header=42, names=ex_col, encoding='cp949')

Index(['차량관리번호', '차량등록번호', '본거지법정동코드', '소유자구분', '차종_등록정보', '용도', '차대번호',
       '최초등록일자', '차량연식', '차량제작일자', '검사유효일', '제원관리번호', '배출가스인증번호', '배출가스등급',
       '저공해조치종류', '저공해조치구조변경YN', '차량말소YN', '취득일자', '취득금액', '차명', '차종_제원정보',
       '차종분류', '차종유형', '자동차형식', '제작사명', '연료', '엔진형식', '총중량', '적재중량', '엔진출력',
       '배기량', '승차인원', '차량길이', '차량너비', '차량높이', '원산지명', '삭제YN', '제원승인일자', '구동형식',
       '변속기종류', '말소일자', '말소코드'],
      dtype='object')

In [38]:
ex.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3653054 entries, 0 to 3653053
Data columns (total 42 columns):
 #   Column       Dtype
---  ------       -----
 0   차량관리번호       object
 1   차량등록번호       object
 2   본거지법정동코드     int64
 3   소유자구분        object
 4   차종_등록정보      object
 5   용도           object
 6   차대번호         object
 7   최초등록일자       int64
 8   차량연식         int64
 9   차량제작일자       float64
 10  검사유효일        float64
 11  제원관리번호       object
 12  배출가스인증번호     object
 13  배출가스등급       object
 14  저공해조치종류      object
 15  저공해조치구조변경YN  object
 16  차량말소YN       object
 17  취득일자         float64
 18  취득금액         float64
 19  차명           object
 20  차종_제원정보      object
 21  차종분류         object
 22  차종유형         object
 23  자동차형식        object
 24  제작사명         object
 25  연료           object
 26  엔진형식         object
 27  총중량          float64
 28  적재중량         float64
 29  엔진출력         object
 30  배기량          float64
 31  승차인원         float64
 32  차량길이         float64
 33  차량너비         float64
 34  차량높이         float64
 35  원산지명         object
 36  삭제YN         object
 37  제원승인일자       object
 38  구동형식         object
 39  변속기종류        object
 40  말소일자         float64
 41  말소코드         object
dtypes: float64(12), int64(3), object(27)
memory usage: 1.1+ GB

In [46]:
ex_pick = ex[['차대번호', '차량말소YN']]
ex_pick.head()

                차대번호 차량말소YN
0  1N4AA6APXJC405871      Y
1  KMHMJ81VP5U242919      Y
2  KN4DAE2C1WK006587      Y
3  KMHDC51DBAU220812      Y
4  KMHJN81VP7U513759      Y

## [로드] 컬럼명 데이터

In [39]:
col_df = pd.read_table('data/컬럼명.txt', sep=',')
col= col_df.columns

In [40]:
col

Index(['차량관리번호', '차량등록번호', '본거지법정동코드', '소유자구분', '차종_등록정보', '용도', '차대번호',
       '최초등록일자', '차량연식', '차량제작일자', '검사유효일', '제원관리번호', '배출가스인증번호', '배출가스등급',
       '저공해조치종류', '저공해조치구조변경YN', '차량말소YN', '취득일자', '취득금액', '차명', '차종_제원정보',
       '차종분류', '차종유형', '자동차형식', '제작사명', '연료', '엔진형식', '총중량', '적재중량', '엔진출력',
       '배기량', '승차인원', '차량길이', '차량너비', '차량높이', '원산지명', '삭제YN', '제원승인일자', '구동형식',
       '변속기종류'],
      dtype='object')

## [로드] 파일1

In [42]:
# 53.9s
df = pd.read_table('data/220819_22.06월기준_1등급.txt', encoding='cp949', header=40, names=col)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2550049 entries, 0 to 2550048
Data columns (total 40 columns):
 #   Column       Dtype
---  ------       -----
 0   차량관리번호       object
 1   차량등록번호       object
 2   본거지법정동코드     int64
 3   소유자구분        object
 4   차종_등록정보      object
 5   용도           object
 6   차대번호         object
 7   최초등록일자       int64
 8   차량연식         int64
 9   차량제작일자       float64
 10  검사유효일        int64
 11  제원관리번호       object
 12  배출가스인증번호     object
 13  배출가스등급       int64
 14  저공해조치종류      float64
 15  저공해조치구조변경YN  object
 16  차량말소YN       object
 17  취득일자         float64
 18  취득금액         float64
 19  차명           object
 20  차종_제원정보      object
 21  차종분류         object
 22  차종유형         object
 23  자동차형식        object
 24  제작사명         object
 25  연료           object
 26  엔진형식         object
 27  총중량          float64
 28  적재중량         float64
 29  엔진출력         float64
 30  배기량          float64
 31  승차인원         int64
 32  차량길이         int64
 33  차량너비         int64
 34  차량높이         int64
 35  원산지명         object
 36  삭제YN         object
 37  제원승인일자       int64
 38  구동형식         object
 39  변속기종류        object
dtypes: float64(8), int64(10), object(22)
memory usage: 778.2+ MB

In [43]:
df.head()

,차량관리번호,차량등록번호,본거지법정동코드,소유자구분,차종_등록정보,용도,차대번호,최초등록일자,차량연식,차량제작일자,...,배기량,승차인원,차량길이,차량너비,차량높이,원산지명,삭제YN,제원승인일자,구동형식,변속기종류
0,KNAGN418BEA492771-01,46오1591,4117310400,주민,승용,자가용,KNAGN418BEA492771,20140213,2014,20140125.0,...,1999.0,5,4845,1835,1455,대한민국,N,20130524,NaN,자동
1,KMHE341DBJA435830-01,273러1139,4420011300,주민,승용,자가용,KMHE341DBJA435830,20171122,2018,20171116.0,...,1999.0,5,4855,1865,1485,대한민국,N,20170309,NaN,자동
2,KNACC81CGJA124863-01,09조2120,3171025924,주민,승용,자가용,KNACC81CGJA124863,20170918,2018,20170913.0,...,1580.0,5,4355,1805,1545,대한민국,N,20170310,NaN,자동
3,KNACB81CGJA149818-01,48루5341,4146310700,주민,승용,자가용,KNACB81CGJA149818,20171204,2018,20171127.0,...,1580.0,5,4355,1805,1545,대한민국,N,20170310,NaN,자동
4,JHMCP26808C201178-01,18부2171,4728032026,주민,승용,자가용,JHMCP26808C201178,20080416,2008,20080404.0,...,2354.0,5,4945,1845,1475,일본,N,20071030,NaN,자동

In [49]:
df['차량말소YN'].unique()

array(['N'], dtype=object)

In [50]:
df2 = df.merge(ex_pick, on='차대번호', how='left')
df2['차량말소YN_y'].unique()

array([nan, 'Y'], dtype=object)

In [51]:
df3 = df2[df2['차량말소YN_y'].isnull() == True]
df3.shape

(2550039, 41)

In [52]:
f = df3.groupby('연료', as_index=False)['차대번호'].count().sort_values('차대번호', ascending=False)
f

            연료    차대번호
5          휘발유  900288
6    휘발유 하이브리드  851246
2  LPG(액화석유가스)  460930
4           전기  298599
3           수소   24132
1    LPG 하이브리드   14556
0    CNG 하이브리드     288

In [53]:
f.columns = ['연료', '1등급']
f

            연료     1등급
5          휘발유  900288
6    휘발유 하이브리드  851246
2  LPG(액화석유가스)  460930
4           전기  298599
3           수소   24132
1    LPG 하이브리드   14556
0    CNG 하이브리드     288

## [excel] 연료별 통계

In [54]:
f1.to_excel('analysis/[G1]연료별_차대번호_통계.xlsx', index=False, encoding='utf-8')

C:\Users\kbj\AppData\Roaming\Python\Python39\site-packages\pandas\util\_decorators.py:211: FutureWarning: the 'encoding' keyword is deprecated and will be removed in a future version. Please take steps to stop the use of 'encoding'
  return func(*args, **kwargs)

# 지역별 수량 통계

## [로드] 법정동코드

In [9]:
code = pd.read_excel('data/지역구분코드(수정).xlsx')
code.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 229 entries, 0 to 228
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ad1     229 non-null    object
 1   code1   229 non-null    int64
 2   ad2     229 non-null    object
 3   code2   229 non-null    int64
dtypes: int64(2), object(2)
memory usage: 7.3+ KB

In [10]:
code = code[['ad1', 'code1']].drop_duplicates(['ad1'], keep='first').reset_index(drop=True)
code

        ad1  code1
0     서울특별시     11
1     부산광역시     26
2     대구광역시     27
3     인천광역시     28
4     광주광역시     29
5     대전광역시     30
6     울산광역시     31
7   세종특별자치시     36
8       경기도     41
9       강원도     42
10     충청북도     43
11     충청남도     44
12     전라북도     45
13     전라남도     46
14     경상북도     47
15     경상남도     48
16  제주특별자치도     50

## 법정동 코드와 매칭

In [11]:
df['본거지법정동코드'].head()

0    4117310400
1    4420011300
2    3171025924
3    4146310700
4    4728032026
Name: 본거지법정동코드, dtype: int64

In [13]:
df2['본거지법정동코드'].isnull().sum()

0

In [14]:
df['지역코드'] = df['본거지법정동코드'].astype('str').str[:2]
df['지역코드'] = df['지역코드'].astype('int')

In [15]:
df['지역코드'].head()

0    41
1    44
2    31
3    41
4    47
Name: 지역코드, dtype: int32

In [16]:
code['code1'].head()

0    11
1    26
2    27
3    28
4    29
Name: code1, dtype: int64

In [17]:
df = df.merge(code, left_on='지역코드', right_on='code1', how='left')
df[['지역코드', 'ad1']].head()

   지역코드    ad1
0    41    경기도
1    44   충청남도
2    31  울산광역시
3    41    경기도
4    47   경상북도

In [18]:
df['ad1'].isnull().sum()

0

In [19]:
l = df.groupby(['ad1'], as_index=False)['차대번호'].count()
l

        ad1    차대번호
0       강원도   71255
1       경기도  615223
2      경상남도  159124
3      경상북도  112010
4     광주광역시   77378
5     대구광역시  125058
6     대전광역시   75177
7     부산광역시  157860
8     서울특별시  390231
9   세종특별자치시   23344
10    울산광역시   51689
11    인천광역시  203201
12     전라남도  115024
13     전라북도   84679
14  제주특별자치도  108603
15     충청남도   99222
16     충청북도   80971

### [excel] 지역별 수량 통계

In [20]:
l.to_excel('analysis/[G1]지역별_차대번호_통계.xlsx', index=False, encoding='utf-8')

C:\Users\kbj\AppData\Roaming\Python\Python39\site-packages\pandas\util\_decorators.py:211: FutureWarning: the 'encoding' keyword is deprecated and will be removed in a future version. Please take steps to stop the use of 'encoding'
  return func(*args, **kwargs)

# 코드 마지막